'''https://sky.pro/wiki/python/ponimaem-funktsiyu-enumerate-v-python-na-primere-koda/
Краткий чек-лист для автотестов
Проверяйте status_code.
Валидируйте JSON-схему или наличие нужных ключей в ответе.
Проверяйте заголовки (Content-Type, Cache-Control).
Используйте сессии для сценариев «вход → действие → выход».
Настраивайте тайм-ауты и обработку ошибок.
Передавайте параметры корректно (GET/POST).
Вывод: requests — это «золотой стандарт» для автоматизации API-тестов и
эмуляции поведения браузера в Python. Освоив эти 8 пунктов, вы сможете писать
стабильные и надежные автотесты.'''


'''https://habr.com/ru/articles/765512/
'''